app/views/questions/_form.html.erb

    <%= f.label :subject %>
    <%= f.collection_select :subject_id, Subject.all, :id, :name, prompt: true %>
---
SELECT "subjects".* FROM "subjects"