app/views/questions/show.html.erb

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."question_id" = ?  ORDER BY "subjects"."id" ASC LIMIT 1  [["question_id", 1]]
---
  <strong>Disciplinas:</strong>
  <% @question.subjects.each { |e| %>