app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
SELECT "questions".* FROM "questions"  WHERE "questions"."subject_id" IS NULL
SELECT "subjects".* FROM "subjects"
---
  def index
    if not params.has_key?("subject_id")
      logger.info("Parameters: #{params}")
      @questions = Question.all
    else
      logger.info "[DEBUG] #{params[:subject_id]}"
      logger.info "[DEBUG] #{params[:subject_id] == 0}"
      if params[:subject_id] == "0"
        @questions = Question.all
      else
        @questions = Question.where(subject_id: params[:subject_id])
      end
    end


    #Para criar dropdown com filtro
    @subjects = Subject.all

SELECT "subjects".* FROM "subjects"
---
  def new
    @question = Question.new
    @subjects = Subject.all

INSERT INTO "questions" ("created_at", "hot", "question", "subject_id", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-01-21 12:28:58.979904"], ["hot", "t"], ["question", "discursivo"], ["subject_id", 1], ["updated_at", "2015-01-21 12:28:58.979904"], ["year", "2015-01-21 12:27:00.000000"]]
---
  def create
    @question = Question.new(question_params)
    respond_to do |format|
      if @question.save

UPDATE "questions" SET "hot" = ?, "updated_at" = ? WHERE "questions"."id" = 3  [["hot", "t"], ["updated_at", "2015-01-21 11:38:24.769254"]]
---
  def update
    respond_to do |format|
      if @question.update(question_params)